from Swarm import Swarm

Table_18 = [(21000, 50000), (50000, 84000), (786000, 987000), (97000, 156000), (125000, 239000), (1008000, 1383000),
            (902000, 115800), (462000, 96000), (465000, 790000), (545000, 908000), (311000, 396000), (675000, 984000),
            (128000, 189000), (105000, 103000), (215000, 285000), (31000, 70000), (42000, 90000), (78000, 73000), ]
border = int(len(Table_18) * 0.7)  # 70 % данных на тренировку ,30 % на проверку результата
train_18 = Table_18[:border]
test_18 = Table_18[border:]


def train(table_18=train_18):
    swarm_app = Swarm(min_x=0, max_x=10, n=2, population=300, generations=1000, table=table_18)
    swarm_app.start()



train()
